//演示的是单独用一个文件来存放各种数据
var post_database=[
{
    title: "谭建荣院士受聘我校",
    img: {
      post_image: "/images/company.jpg"
    },
    result_zan: "92",
    result_shuo: "65",
    conent: "&nbsp;&nbsp;  9月29日下午，中国工程院院士、机械工程专家谭建荣受聘为我校“特聘教授”“双聘院士”。受聘仪式在机械工程学院313室举行，校长周益春、谭建荣院士、机械工程学院院长郑学军共同签署三方协议，周益春向谭建荣颁发聘书并佩戴校徽。",
    detail: "&nbsp;&nbsp;&nbsp;&nbsp;9月29日下午，中国工程院院士、机械工程专家谭建荣受聘为我校“特聘教授”“双聘院士”。受聘仪式在机械工程学院313室举行，校长周益春、谭建荣院士、机械工程学院院长郑学军共同签署三方协议，周益春向谭建荣颁发聘书并佩戴校徽。\n &nbsp;&nbsp;&nbsp;&nbsp; 谭建荣表示，湘大机械工程学院拥有较强的办学实力，在学界得到了广泛认可，尤其是前段时间举办的全国机械工程学院院长联席会议，会议成效显著，进一步扩大了学院的办学影响和知名度。希望今后能与学院同仁一道，共同努力，推动学院进一步提升学科的竞争力。\n &nbsp;&nbsp;&nbsp;&nbsp; 周益春介绍了我校办学历史、工科办学基础等，并与谭建荣就增强与保持学科竞争力交流了看法。周益春认为，机械工程学院要利用原有的学科基础，进一步清晰办学目标，凝炼学科方向，明确主攻目标，增强学科内生力和竞争力。同时要积极投身于地方经济社会发展，以问题为导向，致力于解决重大工程问题，更好地服务于国家和地方经济社会发展需求，在服务中体现自身价值，并在此过程中促进学科本身的长足发展。\n &nbsp;&nbsp;&nbsp;&nbsp; 谭建荣主要从事机械设计及理论、计算机辅助设计与图形学、数字化设计与制造等领域的研究。他的研究成果被国家自然科学基金委员会工程与材料科学部和中国机械工程学会列为2004年机械工业科学技术9项重大进展之一，在包括一批装备行业大型骨干企业在内的多家有影响的制造企业得到成功的应用，有效地支撑和支持了国产重要装备的设计与创新，推进了装备制造企业的技术进步和数字化设计与制造技术的发展。\n &nbsp;&nbsp;&nbsp;&nbsp; 此前，谭建荣院士曾指导我校开展了多项重点工作，对机械工程学院实验平台建设、科研方向凝练、科研队伍培养，以及学院发展战略定位等进行分析探讨和长远规划指导，并担任我校“复杂轨迹加工工艺及装备”教育部工程研究中心技术委员会主任、“焊接机器人与应用技术”湖南省重点实验室学术委员会主任、机械工程学院学术委员会主任委员等职。",
    postId:0
   // 为每一个文件摘要设置一个id用于区分，以便后来能展开详情页
},
{
  title: "2018年研究生招生工作会议召开",
    img: {
      post_image: "/images/meeting.jpg"
    },
    result_zan: "56",
    result_shuo: "68",
  conent: "&nbsp;&nbsp; 9月29日上午，我校2018年研究生招生工作会议在法学院东附楼一楼会议室召开，校长周益春、副校长黄竹青以及各学院院长、分管研究生教育的副院长、研究生干事参加了会议。会议由黄竹青主持。",
  detail: "&nbsp;&nbsp;&nbsp;&nbsp;  9月29日上午，我校2018年研究生招生工作会议在法学院东附楼一楼会议室召开，校长周益春、副校长黄竹青以及各学院院长、分管研究生教育的副院长、研究生干事参加了会议。会议由黄竹青主持。\n &nbsp;&nbsp;&nbsp;&nbsp;研究生院院长王先友及招生负责人用详细的数据介绍了近年来我校硕士研究生的招生情况以及2019年研究生招生的预报名情况，部署了我校2019年硕士研究生招生工作安排，并就招生宣传、生源质量、导师的招生资格认定等方面提出了相关要求。商学院、化学学院、信息工程学院负责人作为学院代表分享了研究生招生工作过程中好的做法和成功经验。\n &nbsp;&nbsp;&nbsp;&nbsp;黄竹青指出，研究生招生工作需要校院联动，凝聚力量，协同推进，共同突破。各单位要强化责任意识，继续努力，主动作为，加大招生宣传力度，创新方式吸引优秀生源，不断扩大生源数量、提升生源质量，开创研究生招生新局面，取得研究生招生新突破，为学校高层次人才培养把好源头关，为学校“双一流”建设做出新的贡献。\n &nbsp;&nbsp;&nbsp;&nbsp; 周益春肯定了学校研究生招生工作取得的成绩，强调了硕士研究生招生工作的重要性，并从国家、湖南省、学校三个层面，分析了高等教育的结构优化趋势，提出了学校本科与研究生比例、师生比的优化目标。各学院要从学校总体战略布局出发，进一步凝练学科方向，集中力量办大事，把研究生招生和培养工作统一到学校“双一流”建设中来，不断提升高层次人次培养质量，把湘潭大学办得更好、更有特色，更好地为国家和地方经济社会发展服务。",
    postId: 1
},
{
  title: "田永清将军传授“人生十宝”",
    img: {
      post_image: "/images/talking.jpg"
    },
    result_zan: "65",
    result_shuo: "67",
  conent: "&nbsp;&nbsp; 9月28日，原总参兵种部政委田永清少将做客我校韶风名家论坛，为我校2018级新生做了两场题为《人生十宝》的报告。两场报告会分别由校党委副书记高协平、副校长刘建平主持。",
  detail: "&nbsp;&nbsp;&nbsp;&nbsp; 9月28日，原总参兵种部政委田永清少将做客我校韶风名家论坛，为我校2018级新生做了两场题为《人生十宝》的报告。两场报告会分别由校党委副书记高协平、副校长刘建平主持。\n &nbsp;&nbsp;&nbsp;&nbsp; 田永清将军结合自己的经历，旁征博引，妙语连珠。他将自己几十年间学习、积累、感悟出来的人生体验概括为十句话，送给2018级新生“人生十宝”。\n &nbsp;&nbsp;&nbsp;&nbsp; 第一句话，要结交“两个朋友”：一个是运动场，一个是图书馆。到运动场锻炼身体，强健体魄；到图书馆博览群书，不断地“充电”“蓄电”“放电”。\n &nbsp;&nbsp;&nbsp;&nbsp; 第二句话，培养“两种功夫”：一个是本分，一个是本事。做人靠本分，做事靠本事，靠“两本”起家靠得住 \n &nbsp;&nbsp;&nbsp;&nbsp;  第三句话，乐于吃“两样东西”：一个是吃亏，一个是吃苦。做人不怕吃亏，做事不怕吃苦。吃亏是福，吃苦是福。\n &nbsp;&nbsp;&nbsp;&nbsp; 第四句话，具备“两种力量”：一种是思想的力量，一种是利剑的力量。思想的力量往往战胜利剑的力量，这是拿破仑的名言。一个人的思想走多远，他就有可能走多远。\n &nbsp;&nbsp;&nbsp;&nbsp;  第五句话，追求“两个一致”：兴趣与事业一致、婚姻与爱情一致。兴趣与事业一致，就能使你的潜力最大限度地得以发挥。恩格斯说，婚姻要以爱情为基础。没有爱情的婚姻是不道德的婚姻，也不是牢固的婚姻。\n &nbsp;&nbsp;&nbsp;&nbsp; 第六句话，插上“两个翅膀”：一个叫理想，一个叫毅力。如果一个人有了这“两个翅膀”，他就能飞得高，飞得远。\n &nbsp;&nbsp;&nbsp;&nbsp;  第七句话，构建“两个支柱”：一个是科学，一个是人文。这是大科学家钱学森一再强调的。一个大写的“人”，必须由科学与人文这两个支柱来支撑。\n &nbsp;&nbsp;&nbsp;&nbsp;  第八句话，配备“两个保健医生”：一个叫运动，一个叫乐观。运动使你生理健康，乐观使你心理健康。田永清说他几十年来养成了两个习惯：日行万步路，夜读十页书。\n &nbsp;&nbsp;&nbsp;&nbsp;  第九句话，记住“两个秘诀”： 一个是健康的秘诀在早上，一个是成功的秘诀在晚上。黎明即起，锻炼身体，强健体魄，争取健康的工作50年。必要时晚上还要加班加点，主要用来读书、思考、写作。大科学家爱因斯坦说过：人的差异产生于业余时间。业余时间能成就一个人，也能毁灭一个人。\n &nbsp;&nbsp;&nbsp;&nbsp;  第十句话，追求“两个极致”：一个是把自身的潜力发展到极致，一个是把自己的寿命健康延长到极致。人的发展潜力还大有空间，青年学生一定要努力学习，开发潜能。健康长寿能让自己不受罪，亲人不受累，节省医药费，有利全社会。\n &nbsp;&nbsp;&nbsp;&nbsp;  田永清将军的报告赢得了同学们的阵阵热烈掌声。他还现场朗诵了毛泽东主席的《沁园春·雪》，并一一回答了同学们提出的问题。公共管理学院2018级行政管理1班学生钱文彬表示，听了报告深受鼓舞，在今后学习生活中一定要锻炼好身体，努力学习，争取大学毕业后继续深造，做社会和国家的有用之才。",
  postId: 2
},
{
    title: "我校学子上演红色经典诵读大赛",
    img: {
      post_image: "/images/speak.jpg"
    },
    result_zan: "96",
    result_shuo: "25",
  conent: "&nbsp;&nbsp; 9月28日晚，北山四阶诵读声四起，来自各个学院的18支代表队在此以“传承红色基因、汇聚强军力量”为主题，重温红色经典，诵读红色故事。",
  detail: "&nbsp;&nbsp;&nbsp;&nbsp; 9月28日晚，北山四阶诵读声四起，来自各个学院的18支代表队在此以“传承红色基因、汇聚强军力量”为主题，重温红色经典，诵读红色故事。\n &nbsp;&nbsp;&nbsp;&nbsp;湖南省大学生红色经典诵读活动在我校毛主席铜像广场启动之后，我校随即在全校范围内开展红色经典诵读大赛，旨在引导学生通过诵读方式，传承红色基因，感悟革命精神，激发爱国情怀。比赛分为上下两节，前9支代表队表演结束后，主持人公布比赛得分。中场由古莲汉韵社带来舞蹈表演《礼仪之邦》，优美的古风舞蹈缓解了现场的紧张气氛。后面9支队伍表演结束后，公布最终结果。\n &nbsp;&nbsp;&nbsp;&nbsp;18支代表队的表演或激情澎湃，或深情感人。诵读方式新颖多样，诵读者们分工协调，配合默契，以饱满的爱国情怀诉说着对祖国的热爱。部分代表队还加入了舞蹈、情景剧等艺术元素，使观众们身临其境。文学与新闻学院诵读的《红铁》，感情迸发，震撼人心，用激昂有力的声音表现了农民、军人、学生等各个身份的中华儿女“化为红铁，绝不做亡国奴”的爱国豪情；艺术学院用充沛的情感与动人的演绎诠释了艾青的作品《光的赞歌》，表达了燃烧自己照亮世界的崇高情怀；在化学学院带来的表演《忆峥嵘岁月，承红色经典》中，利用年轻学子、革命战士、烈士家属、革命胜利四个情景诠释了回忆与传承的诵读主题；环境与资源学院带来的《我有祖国，我有母语》用婴儿呓语、教师授课、主席题字三个情景表达了对祖国和母语的深切情感。土木工程与力学学院诵读的《大堰河，我的保姆》感情充沛，催人泪下，表达了对中国广大劳动人民的赞美与感恩。\n &nbsp;&nbsp;&nbsp;&nbsp;本次比赛中，文学与新闻学院获得一等奖，艺术学院、化学学院获得二等奖，兴湘学院、外国语学院、法学院·知识产权学院·信用风险管理学院获得三等奖，土木工程与力学学院、环境与资源学院、材料科学与工程学院、化工学院、公共管理学院获得优秀组织奖。\n &nbsp;&nbsp;&nbsp;&nbsp;本次比赛由学生工作（部）处、人民武装部主办。",
  postId: 3
}
];
module.exports = {    //设置出口，把post_database的值给posts_List属性
  posts_List: post_database
}